In [1]:
import pandas as pd
import numpy as np

lis = eval(input())
pdList = pd.Series(lis)
pdList

0    1
1    2
2    3
3    4
4    5
dtype: int64

In [2]:
pdList.astype("int32")
print(pdList.dtype,end="")
pdList = pdList.to_list()
pdList

int64

[1, 2, 3, 4, 5]

In [3]:
ser1 = pd.Series([1,2,3,4,5])
ser2 = pd.Series([6,7,8,9,10])
ser1 >= ser2

0    False
1    False
2    False
3    False
4    False
dtype: bool

In [4]:
ser1 = ser1.astype('int32')
ser1.dtype

dtype('int32')

In [5]:
df = pd.DataFrame({'name': ['Anastasia', 'Dima', 'Katherine', 'James', 'Emily', 'Michael',
 'Matthew', 'Laura', 'Kevin', 'Jonas'],
 'score': [12.5, 9, 16.5, np.nan, 9, 20, 14.5, np.nan, 8, 19],
 'attempts': [1, 3, 2, 3, 2, 3, 1, 1, 2, 1],
 'qualify': ['yes', 'no', 'yes', 'no', 'no', 'yes', 'yes', 'no', 'no', 'yes'],},
 index = ['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j'])

In [6]:
df.head(3)

        name  score  attempts qualify
a  Anastasia   12.5         1     yes
b       Dima    9.0         3      no
c  Katherine   16.5         2     yes

In [10]:
df = pd.DataFrame({
    'school_code': ['s001','s002','s003','s001','s002','s004'],
    'class': ['V', 'V', 'VI', 'VI', 'V', 'VI'],
    'name': ['Alberto Franco','Gino Mcneill','Ryan Parkes', 'Eesha Hinton', 'Gino Mcneill', 'David Parkes'],
    'date_Of_Birth': ['15/05/2002','17/05/2002','16/02/1999','25/09/1998','11/05/2002','15/09/1997'],
    'weight': [35, 32, 33, 30, 31, 32],
    'address': ['street1', 'street2', 'street3', 'street1', 'street2', 'street4'],
    't_id':['t1', 't2', 't3', 't4', 't5', 't6']})

In [11]:
df.set_index('class')

      school_code            name date_Of_Birth  weight  address t_id
class
V            s001  Alberto Franco    15/05/2002      35  street1   t1
V            s002    Gino Mcneill    17/05/2002      32  street2   t2
VI           s003     Ryan Parkes    16/02/1999      33  street3   t3
VI           s001    Eesha Hinton    25/09/1998      30  street1   t4
V            s002    Gino Mcneill    11/05/2002      31  street2   t5
VI           s004    David Parkes    15/09/1997      32  street4   t6

In [12]:
df.reset_index()

   index school_code class            name date_Of_Birth  weight  address t_id
0      0        s001     V  Alberto Franco    15/05/2002      35  street1   t1
1      1        s002     V    Gino Mcneill    17/05/2002      32  street2   t2
2      2        s003    VI     Ryan Parkes    16/02/1999      33  street3   t3
3      3        s001    VI    Eesha Hinton    25/09/1998      30  street1   t4
4      4        s002     V    Gino Mcneill    11/05/2002      31  street2   t5
5      5        s004    VI    David Parkes    15/09/1997      32  street4   t6

In [15]:
df['date_Of_Birth'] = pd.to_datetime(df['date_Of_Birth'])

/var/folders/vv/jrr00v852xj6f_6pp777r9zw0000gp/T/ipykernel_2859/3746784266.py:1: UserWarning: Parsing dates in DD/MM/YYYY format when dayfirst=False (the default) was specified. This may lead to inconsistently parsed dates! Specify a format to ensure consistent parsing.
  df['date_Of_Birth'] = pd.to_datetime(df['date_Of_Birth'])

In [16]:
df.set_index('date_Of_Birth')

              school_code class            name  weight  address t_id
date_Of_Birth
2002-05-15           s001     V  Alberto Franco      35  street1   t1
2002-05-17           s002     V    Gino Mcneill      32  street2   t2
1999-02-16           s003    VI     Ryan Parkes      33  street3   t3
1998-09-25           s001    VI    Eesha Hinton      30  street1   t4
2002-11-05           s002     V    Gino Mcneill      31  street2   t5
1997-09-15           s004    VI    David Parkes      32  street4   t6

In [17]:
df.index.name = "index"

In [18]:
df

      school_code class            name date_Of_Birth  weight  address t_id
index
0            s001     V  Alberto Franco    2002-05-15      35  street1   t1
1            s002     V    Gino Mcneill    2002-05-17      32  street2   t2
2            s003    VI     Ryan Parkes    1999-02-16      33  street3   t3
3            s001    VI    Eesha Hinton    1998-09-25      30  street1   t4
4            s002     V    Gino Mcneill    2002-11-05      31  street2   t5
5            s004    VI    David Parkes    1997-09-15      32  street4   t6

In [19]:
df.loc[0]

school_code                     s001
class                              V
name                  Alberto Franco
date_Of_Birth    2002-05-15 00:00:00
weight                            35
address                      street1
t_id                              t1
Name: 0, dtype: object